--
-- データベース: noblestock
--

--
-- テーブルのデータのダンプ categories
--

INSERT INTO categories (id, category_name, remarks, created_at, created_by, updated_at, updated_by) VALUES
(10, 'カテゴリ10', '備考10', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(20, 'カテゴリ20', '備考20', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(30, 'カテゴリ30', '備考30', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(40, 'カテゴリ40', '備考40', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(50, 'カテゴリ50', '備考50', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(60, 'カテゴリ60', '備考60', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(70, 'カテゴリ70', '備考70', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(80, 'カテゴリ80', '備考80', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(90, 'カテゴリ90', '備考90', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin'),
(100, 'カテゴリ100', '備考100', '2026-01-27 09:45:24', 'admin', '2026-01-27 09:45:24', 'admin');

--
-- テーブルのデータのダンプ configs
--

INSERT INTO configs (config_key, value_int, value_str, config_description, created_at, created_by, updated_at, updated_by) VALUES
('BAR_PRO_FLG', 1, NULL, 'バーコード商品選択出力<br/>　0：選択出力不可<br/>　1：選択出力可能', '2014-09-10 19:24:30', 'admin', '2014-09-10 19:24:30', 'admin'),
('BAR_PRT_SIZE', 2, NULL, 'バーコード印刷サイズ<br/>　1：Code39,JAN,UPC-A（3×8）<br/>　2：Code128,JAN,UPC-A（3×8）<br/>　3：Code128,JAN,UPC-A（3×8）画像付<br/>　4：Code128,JAN,UPC-A（4×11）<br/>　5：Code128,JAN,UPC-A（5×13）', '2013-03-27 21:20:30', 'admin', '2017-01-11 21:30:00', 'admin'),
('EXCEL_VAR', 1, NULL, 'Excelバージョン<br/>　0：Excel97-2003<br/>　1：Excel2007-2016', '2013-03-27 21:20:30', 'admin', '2013-03-27 21:20:30', 'admin'),
('LABEL_LOWER', 4, NULL, 'ラベル表示（下段）', '2017-01-11 21:30:00', 'admin', '2017-01-11 21:30:00', 'admin'),
('LABEL_UPPER', 2, NULL, 'ラベル表示（上段）', '2017-01-11 21:30:00', 'admin', '2017-01-11 21:30:00', 'admin'),
('SHIP_FLG', 3, NULL, '履歴<br/>　0：非表示<br/>　1：履歴表示<br/>　2：入出庫実績表示<br/>　3：全表示', '2013-03-27 21:20:30', 'admin', '2013-03-27 21:20:30', 'admin'),
('STOCK_LOW_INTERVAL', 0, NULL, '在庫数低下通知 間隔<br/>　0：設定なし', '2014-04-25 14:45:30', 'admin', '2014-04-25 14:45:30', 'admin'),
('STOCK_LOW_LIMIT', 10, NULL, '在庫数低下通知 下限値<br/>　0：設定なし', '2014-04-23 20:11:30', 'admin', '2014-04-23 20:11:30', 'admin');

--
-- テーブルのデータのダンプ histories
--

INSERT INTO histories (id, history_yy, history_mm, history_dd, history_kbn, management_no, branch_no, category_name, maker_name, product_name, location_name, quantity, stock_in, move_stock, location_stock, stock, del_flg, created_at, created_by, updated_at, updated_by) VALUES
(1, 2026, 1, 27, 2, 'ABC001', 2, NULL, NULL, '商品サンプルABC001', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(2, 2026, 1, 27, 2, 'ABC002', 2, NULL, NULL, '商品サンプルABC002', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(3, 2026, 1, 27, 2, 'ABC003', 2, NULL, NULL, '商品サンプルABC003', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(4, 2026, 1, 27, 2, 'ABC004', 2, NULL, NULL, '商品サンプルABC004', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(5, 2026, 1, 27, 2, 'ABC005', 2, NULL, NULL, '商品サンプルABC005', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(6, 2026, 1, 27, 2, 'ABC006', 2, NULL, NULL, '商品サンプルABC006', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(7, 2026, 1, 27, 2, 'ABC007', 2, NULL, NULL, '商品サンプルABC007', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(8, 2026, 1, 27, 2, 'ABC008', 2, NULL, NULL, '商品サンプルABC008', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(9, 2026, 1, 27, 2, 'ABC009', 2, NULL, NULL, '商品サンプルABC009', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(10, 2026, 1, 27, 2, 'ABC010', 2, NULL, NULL, '商品サンプルABC010', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(11, 2026, 1, 27, 2, 'ABC011', 2, NULL, NULL, '商品サンプルABC011', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(12, 2026, 1, 27, 2, 'ABC012', 2, NULL, NULL, '商品サンプルABC012', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(13, 2026, 1, 27, 2, 'ABC013', 2, NULL, NULL, '商品サンプルABC013', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(14, 2026, 1, 27, 2, 'ABC014', 2, NULL, NULL, '商品サンプルABC014', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(15, 2026, 1, 27, 2, 'ABC015', 2, NULL, NULL, '商品サンプルABC015', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(16, 2026, 1, 27, 2, 'ABC016', 2, NULL, NULL, '商品サンプルABC016', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(17, 2026, 1, 27, 2, 'ABC017', 2, NULL, NULL, '商品サンプルABC017', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(18, 2026, 1, 27, 2, 'ABC018', 2, NULL, NULL, '商品サンプルABC018', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(19, 2026, 1, 27, 2, 'ABC019', 2, NULL, NULL, '商品サンプルABC019', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(20, 2026, 1, 27, 2, 'ABC020', 2, NULL, NULL, '商品サンプルABC020', '', 0, 0, 0, 0, 0, 0, '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
(21, 2026, 1, 27, 0, 'ABC001', 2, NULL, NULL, '商品サンプルABC001', '店舗10', 0, 120, 0, 120, 120, 0, '2026-01-27 10:07:46', 'admin', '2026-01-27 10:07:46', 'admin'),
(22, 2026, 1, 27, 0, 'ABC002', 2, NULL, NULL, '商品サンプルABC002', '店舗20', 0, 300, 0, 300, 300, 0, '2026-01-27 10:08:32', 'admin', '2026-01-27 10:08:32', 'admin'),
(23, 2026, 1, 27, 1, 'ABC001', 2, NULL, NULL, '商品サンプルABC001', '店舗10', 50, 0, 0, 70, 70, 0, '2026-01-27 10:08:57', 'admin', '2026-01-27 10:08:57', 'admin'),
(24, 2026, 1, 27, 0, 'ABC003', 2, NULL, NULL, '商品サンプルABC003', '店舗20', 0, 30, 0, 30, 30, 0, '2026-01-27 10:09:33', 'admin', '2026-01-27 10:09:33', 'admin'),
(25, 2026, 1, 27, 5, 'ABC003', 2, NULL, NULL, '商品サンプルABC003', '店舗20', 0, 0, 30, 0, 0, 0, '2026-01-27 10:10:07', 'admin', '2026-01-27 10:10:07', 'admin'),
(26, 2026, 1, 27, 6, 'ABC003', 2, NULL, NULL, '商品サンプルABC003', '店舗30', 0, 0, 30, 30, 30, 0, '2026-01-27 10:10:07', 'admin', '2026-01-27 10:10:07', 'admin');

--
-- テーブルのデータのダンプ locations
--

INSERT INTO locations (id, location_name, remarks, created_at, created_by, updated_at, updated_by) VALUES
(10, '店舗10', '備考店舗10', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(20, '店舗20', '備考店舗20', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(30, '店舗30', '備考店舗30', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(40, '店舗40', '備考店舗40', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(50, '店舗50', '備考店舗50', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(60, '店舗60', '備考店舗60', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(70, '店舗70', '備考店舗70', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(80, '店舗80', '備考店舗80', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(90, '店舗90', '備考店舗90', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin'),
(100, '店舗100', '備考店舗100', '2026-01-27 09:46:48', 'admin', '2026-01-27 09:46:48', 'admin');

--
-- テーブルのデータのダンプ makers
--

INSERT INTO makers (id, maker_name, remarks, created_at, created_by, updated_at, updated_by) VALUES
(10, 'メーカー10', '備考10', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(20, 'メーカー20', '備考20', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(30, 'メーカー30', '備考30', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(40, 'メーカー40', '備考40', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(50, 'メーカー50', '備考50', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(60, 'メーカー60', '備考60', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(70, 'メーカー70', '備考70', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(80, 'メーカー80', '備考80', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(90, 'メーカー90', '備考90', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin'),
(100, 'メーカー100', '備考100', '2026-01-27 09:45:46', 'admin', '2026-01-27 09:45:46', 'admin');

--
-- テーブルのデータのダンプ products
--

INSERT INTO products (management_no, category_id, maker_id, product_name, wholesale_amount, retail_amount, sell_amount, quantity, unit_id, storage_place, image_file, remarks, remarks2, created_at, created_by, updated_at, updated_by) VALUES
('ABC001', 10, 10, '商品サンプルABC001', 1, 1, 1, 0, NULL, '保管場所01', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC002', 20, 20, '商品サンプルABC002', 1, 1, 1, 0, NULL, '保管場所02', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC003', 30, 30, '商品サンプルABC003', 1, 1, 1, 0, NULL, '保管場所03', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC004', 40, 40, '商品サンプルABC004', 1, 1, 1, 0, NULL, '保管場所04', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC005', 50, 50, '商品サンプルABC005', 1, 1, 1, 0, NULL, '保管場所05', '', '備考01', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC006', 60, 60, '商品サンプルABC006', 1, 1, 1, 0, NULL, '保管場所06', '', '', '備考02', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC007', 70, 70, '商品サンプルABC007', 1, 1, 1, 0, NULL, '保管場所07', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC008', 80, 80, '商品サンプルABC008', 1, 1, 1, 0, NULL, '保管場所08', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC009', 90, 90, '商品サンプルABC009', 1, 1, 1, 0, NULL, '保管場所09', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC010', 100, 100, '商品サンプルABC010', 1, 1, 1, 0, NULL, '保管場所10', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC011', 10, 10, '商品サンプルABC011', 1, 1, 1, 0, NULL, '保管場所01', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC012', 20, 20, '商品サンプルABC012', 1, 1, 1, 0, NULL, '保管場所02', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC013', 30, 30, '商品サンプルABC013', 1, 1, 1, 0, NULL, '保管場所03', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC014', 40, 40, '商品サンプルABC014', 1, 1, 1, 0, NULL, '保管場所04', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC015', 50, 50, '商品サンプルABC015', 1, 1, 1, 0, NULL, '保管場所05', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC016', 60, 60, '商品サンプルABC016', 1, 1, 1, 0, NULL, '保管場所06', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC017', 70, 70, '商品サンプルABC017', 1, 1, 1, 0, NULL, '保管場所07', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC018', 80, 80, '商品サンプルABC018', 1, 1, 1, 0, NULL, '保管場所08', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC019', 90, 90, '商品サンプルABC019', 1, 1, 1, 0, NULL, '保管場所09', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin'),
('ABC020', 100, 100, '商品サンプルABC020', 1, 1, 1, 0, NULL, '保管場所10', '', '', '', '2026-01-27 09:44:05', 'admin', '2026-01-27 09:44:05', 'admin');

--
-- テーブルのデータのダンプ stocks
--

INSERT INTO stocks (management_no, location_id, quantity, remarks, created_at, created_by, updated_at, updated_by) VALUES
('ABC001', 10, 70, NULL, '2026-01-27 10:07:46', 'admin', '2026-01-27 10:08:57', 'admin'),
('ABC002', 20, 300, NULL, '2026-01-27 10:08:32', 'admin', '2026-01-27 10:08:32', 'admin'),
('ABC003', 20, 0, NULL, '2026-01-27 10:09:33', 'admin', '2026-01-27 10:10:07', 'admin'),
('ABC003', 30, 30, NULL, '2026-01-27 10:10:07', 'admin', '2026-01-27 10:10:07', 'admin');

--
-- テーブルのデータのダンプ units
--

INSERT INTO units (id, unit_name, remarks, created_at, created_by, updated_at, updated_by) VALUES
(10, '個', '備考10', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(20, '台', '備考20', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(30, '本', '備考30', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(40, '枚', '備考40', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(50, '箱', '備考50', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(60, '束', '備考60', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(70, 'セット', '備考70', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin'),
(80, 'その他', '備考80', '2026-01-27 09:45:56', 'admin', '2026-01-27 09:45:56', 'admin');

--
-- テーブルのデータのダンプ users
--

INSERT INTO users (id, login_id, password_hash, sort_order, user_name, furigana, email, authority, created_at, created_by, updated_at, updated_by) VALUES
(1, 'admin', '$2y$10$VKCxCYz9C9iih4NDEmONV.B4vS1yxoncrm5YuW1k2e4.rvmSGugfa', 1, '管理者がう', 'カンリシャガウ', 'admingau@example.com', '11111111111111111111', '2026-01-27 09:47:08', 'admin', '2026-01-27 09:47:08', 'admin'),
(2, 'user1', '$2y$10$e3dt5BuAhbSe3DgAUrTgIusI/XKbx0PvMB2PQqZSXRovkT/wlJqri', 3, 'ユーザ1', '', '', '11111111111111111100', '2026-01-27 09:47:08', 'admin', '2026-01-27 09:47:08', 'admin'),
(3, 'user2', '$2y$10$WvQx6rQE3x1MKYhKbCvCTeZAXDpZ3LSMmXiFjwW3ZK9YaaUJqooKy', 4, 'ユーザ2', '', '', '11111111111111111100', '2026-01-27 09:47:09', 'admin', '2026-01-27 09:47:09', 'admin'),
(4, 'user3', '$2y$10$QK5/lf8euFKFWvRFqipKwuZLa1zozWC40F9VqRE6hAJv8v9Drx6oW', 5, 'ユーザ3', '', '', '11111111111111111100', '2026-01-27 09:47:09', 'admin', '2026-01-27 09:47:09', 'admin');
INSERT INTO users (id, login_id, password_hash, sort_order, user_name, furigana, email, authority, created_at, created_by, updated_at, updated_by) VALUES
(100, 'noauth', '$2y$10$ADH/yKvsujUreUMPny6x0OOlIUjk8KMFTqZL9s91VkXOQ76m2YdYW', 100, 'No Auth', '', '', '00000000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(101, 'perm00', '$2y$10$YqviMhGXRuX8.kwboK.Vne6/FPg/8MK5TVNKHKbRc3wYgm9oS9VEy', 101, 'Perm 00', '', '', '10000000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(102, 'perm01', '$2y$10$SZTusgyGALQh0YdSxcIWXuu.1lXpKDomkkk4B5lbcNx35pkak078G', 102, 'Perm 01', '', '', '01000000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(103, 'perm02', '$2y$10$zBk0vS7lYAqrKjbbXOmlQ.8NnCqkO0a41LWQOCoydbfKPE8O7ryQe', 103, 'Perm 02', '', '', '00100000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(104, 'perm03', '$2y$10$ZHFSMCmzKZbQjSaDb/VwuOli8rWMFUA7d08i5LPRQSe6jLiDZiUqm', 104, 'Perm 03', '', '', '00010000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(105, 'perm04', '$2y$10$Rw7yZ5nvJLCUNum.1gfmm.4El5tyCq4miInbe3b2HoKOER.3ABqsG', 105, 'Perm 04', '', '', '00001000000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(106, 'perm05', '$2y$10$PsqElQxw/cA8S0tOi6BPVOlVI70vEtu7h0F0b2TQZPX5dsL5jlIhC', 106, 'Perm 05', '', '', '00000100000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(107, 'perm06', '$2y$10$J4JOIcaoAGA/DGD7BTM3xeA.4wX3hP.wT5rFA1ZuTl8A7UqOIwqlq', 107, 'Perm 06', '', '', '00000010000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(108, 'perm07', '$2y$10$rXfthAXvI6.hj/NOzC1AYOQAt.hydxB5/G19NN0wMwKOfpgmz5jVS', 108, 'Perm 07', '', '', '00000001000000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(109, 'perm08', '$2y$10$1LmOVJFwWaQJkCQg8SLKHuWrg5sKCzdrpz3Woq7s9jlYAia4Ndp9W', 109, 'Perm 08', '', '', '00000000100000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(110, 'perm09', '$2y$10$E6zQlpxiOzTungNTboeiwOerOLZz8OHxrTVP91H3hBBkEhPBAWvg2', 110, 'Perm 09', '', '', '00000000010000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(111, 'perm10', '$2y$10$QtVqH92XYFzR4SR3r/HZQuxp1V5pJ5U.dDK4OwOJsrNF0AxLPzp.y', 111, 'Perm 10', '', '', '00000000001000000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(112, 'perm11', '$2y$10$0G.IpsxdAmURhhH./K3C1O8XDjpMhFUSRloJJntJa90PmEY8N.5la', 112, 'Perm 11', '', '', '00000000000100000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(113, 'perm12', '$2y$10$pyWhbi2nJ9W.ENBVX.HIQOTYYcRUV/w9yeJtGSu2jrzElcXEffx/2', 113, 'Perm 12', '', '', '00000000000010000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(114, 'perm13', '$2y$10$0xQ92pPRm5MGtR4P5RlFg.cDZ.jpRtkanxUr9TOe75gfECqUNnb/6', 114, 'Perm 13', '', '', '00000000000001000000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(115, 'perm14', '$2y$10$Ron5BIJ8dQKbatP.kExUUuqYyBG.pMgKku4l0wQmrL74V9sHesv5O', 115, 'Perm 14', '', '', '00000000000000100000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(116, 'perm15', '$2y$10$xAJV5mEcFT7ip6MI6fMujuTYaTEriv30WavPqfNSkGep4s.Z7V/vC', 116, 'Perm 15', '', '', '00000000000000010000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(117, 'perm16', '$2y$10$h2vtlatk1Oz20hkoM28ThOpiwwAViUrftcOTSJ/pcfQuMvf1PfOHa', 117, 'Perm 16', '', '', '00000000000000001000', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(118, 'perm17', '$2y$10$QB8Ogv4wTFpM7W8J2ZT.eOmzUyGysD1rv31/6MwelAO0wLjDqDL..', 118, 'Perm 17', '', '', '00000000000000000100', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(119, 'perm18', '$2y$10$.DKBvkPAJ7FV6x9g5d2E5e9hSwSPQfTGINsB85jD//fx.jfCs09Vm', 119, 'Perm 18', '', '', '00000000000000000010', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin'),
(120, 'perm19', '$2y$10$xVKvt79hbbyRTe/2C8HC2eczXxWZ.5g3Y9ZusXne5v51UDNyAZicC', 120, 'Perm 19', '', '', '00000000000000000001', '2026-01-27 09:47:10', 'admin', '2026-01-27 09:47:10', 'admin');
COMMIT;
